//======================ДВА СПОСОБА ИНИЦИАЛИЗАЦИИ ПОРТА=========================================
//================================== 1 =========================================================

import processing.serial.*;  // Подключаем библиотеку serial 
Serial serial;               //  Называем её serial

void setup() {
  size(400, 200);                // Размеры основного рабочего окна
  String str[] = Serial.list();  // Вывести доступные рабочие порты(получаем массив строк)
  print(str[0]);
}

void draw() {
}

//=================================== 2 =========================================================

int speed = 9600;

import processing.serial.*;  // Подключаем библиотеку serial 
Serial serial;               //  Называем её serial

void setup() {
  size(400, 200);                // Размеры основного рабочего окна
  // Инициализация порта
  String str[] = Serial.list();
  serial = new Serial (this, str[0], speed);                                        // str[0] можно заменить на "COMn" n - это номер порта 1,2,3...
}

void draw() {
}
//==================================================================================================

//==================================================================================================
